{"keras_version": "2.0.8", "backend": "tensorflow", "config": {"input_layers": [["char_input", 0, 0]], "output_layers": [["time_distributed_2", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "char_input", "config": {"batch_input_shape": [null, 40, 16], "dtype": "int32", "sparse": false, "name": "char_input"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["char_input", 0, 0, {}]]], "name": "reshape_1", "config": {"trainable": true, "target_shape": [640], "name": "reshape_1"}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "embedding_1", "config": {"input_length": 640, "name": "embedding_1", "trainable": true, "output_dim": 64, "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "batch_input_shape": [null, 640], "input_dim": 83}, "class_name": "Embedding"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "reshape_2", "config": {"trainable": true, "target_shape": [40, 16, 64], "name": "reshape_2"}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "conv2d_1", "config": {"use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [4, 8], "data_format": "channels_first", "filters": 40, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [4, 4], "data_format": "channels_first", "filters": 40, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "reshape_3", "config": {"trainable": true, "target_shape": [40, 64], "name": "reshape_3"}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_3", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "trainable": true, "gamma_constraint": null, "center": true, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "time_distributed_1", "config": {"trainable": true, "layer": {"config": {"activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 600}, "class_name": "Dense"}, "name": "time_distributed_1"}, "class_name": "TimeDistributed"}, {"inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2", "config": {"trainable": true, "layer": {"config": {"activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "main_output", "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 65}, "class_name": "Dense"}, "name": "time_distributed_2"}, "class_name": "TimeDistributed"}]}, "class_name": "Model"}